org-files/python.org
:PROPERTIES:
:ID:       06032c9e-2664-4b4d-9bd3-ed72e16768a1
:END:
#+title: python
#+STARTUP: overview
#+filetags: code
#+date: <2025-03-21>

Python es un lenguaje de alto nivel de programación interpretado cuya filosofía hace hincapié en la legibilidad de su código, se utiliza para desarrollar aplicaciones de todo tipo, por ejemplo: Instagram, Netflix, Spotify, Panda3D, entre otros.​ Se trata de un lenguaje de programación multiparadigma, ya que soporta parcialmente la orientación a objetos, programación imperativa y, en menor medida, programación funcional.

*** Enlaces pendientes de revisar
Tutorial automate the boring stuff
https://automatetheboringstuff.com/chapter1/
Programación orientada a objetos https://towardsdatascience.com/python-oop-corey-schafer-datacamp-be6b0b3cafc6
Programación funcional
https://morioh.com/p/8a40c3345286

*** Python en Emacs
**** Guardar y ejecutar  >   C-c C-c
**** Limpiar el shell    >   C-c M-o
*** Pandas
import pandas as pd
Cargar csv -> datos = pd.read_csv(ruta/archivo.csv)
Revisar datos -> datos.describe()
Listar campos -> datos.columns
Columna a variable -> y = datos.lacolumnaquesea
Columnas a dataframe -> x = datos[listadecolumnas]
Mostrar primeras filas de dataframe -> x.head()
Eliminar filas con campos vacíos -> filtered_x = x.dropna(axis=0)
*** Creación de entornos virtuales
- Instalar `virtualenv`:
#+begin_src bash
  sudo apt install python3-pip
  sudo apt install python3-virtualenv
#+end_src
- Crear un nuevo entorno virtual
Ve al directorio en el que deseas crear el entorno virtual y ejecuta el siguiente comando para crear uno nuevo. Puedes reemplazar `mi_entorno` con el nombre que prefieras para tu entorno virtual.
#+begin_src bash
  virtualenv mi_entorno
#+end_src
- Activar entorno virtual
#+begin_src bash
  source mi_entorno/bin/activate
#+end_src
- Desactivar el entorno virtual
#+begin_src bash
  deactivate
#+end_src
