public_html/python.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfccdc22">1. Enlaces pendientes de revisar</a></li>
<li><a href="#orgf848807">2. Python en Emacs</a>
<ul>
<li><a href="#org89825d3">2.1. Guardar y ejecutar  &gt;   C-c C-c</a></li>
<li><a href="#org42c297c">2.2. Limpiar el shell    &gt;   C-c M-o</a></li>
</ul>
</li>
<li><a href="#org0396808">3. Pandas</a></li>
<li><a href="#org578b7ec">4. Creación de entornos virtuales</a></li>
</ul>
</div>
</div>
<p>
Python es un lenguaje de alto nivel de programación interpretado cuya filosofía hace hincapié en la legibilidad de su código, se utiliza para desarrollar aplicaciones de todo tipo, por ejemplo: Instagram, Netflix, Spotify, Panda3D, entre otros.​ Se trata de un lenguaje de programación multiparadigma, ya que soporta parcialmente la orientación a objetos, programación imperativa y, en menor medida, programación funcional.
</p>

<div id="outline-container-orgfccdc22" class="outline-2">
<h2 id="orgfccdc22"><span class="section-number-2">1.</span> Enlaces pendientes de revisar</h2>
<div class="outline-text-2" id="text-1">
<p>
Tutorial automate the boring stuff
<a href="https://automatetheboringstuff.com/chapter1/">https://automatetheboringstuff.com/chapter1/</a>
Programación orientada a objetos <a href="https://towardsdatascience.com/python-oop-corey-schafer-datacamp-be6b0b3cafc6">https://towardsdatascience.com/python-oop-corey-schafer-datacamp-be6b0b3cafc6</a>
Programación funcional
<a href="https://morioh.com/p/8a40c3345286">https://morioh.com/p/8a40c3345286</a>
</p>
</div>
</div>

<div id="outline-container-orgf848807" class="outline-2">
<h2 id="orgf848807"><span class="section-number-2">2.</span> Python en Emacs</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org89825d3" class="outline-3">
<h3 id="org89825d3"><span class="section-number-3">2.1.</span> Guardar y ejecutar  &gt;   C-c C-c</h3>
</div>
<div id="outline-container-org42c297c" class="outline-3">
<h3 id="org42c297c"><span class="section-number-3">2.2.</span> Limpiar el shell    &gt;   C-c M-o</h3>
</div>
</div>
<div id="outline-container-org0396808" class="outline-2">
<h2 id="org0396808"><span class="section-number-2">3.</span> Pandas</h2>
<div class="outline-text-2" id="text-3">
<p>
import pandas as pd
Cargar csv -&gt; datos = pd.read<sub>csv</sub>(ruta/archivo.csv)
Revisar datos -&gt; datos.describe()
Listar campos -&gt; datos.columns
Columna a variable -&gt; y = datos.lacolumnaquesea
Columnas a dataframe -&gt; x = datos[listadecolumnas]
Mostrar primeras filas de dataframe -&gt; x.head()
Eliminar filas con campos vacíos -&gt; filtered<sub>x</sub> = x.dropna(axis=0)
</p>
</div>
</div>
<div id="outline-container-org578b7ec" class="outline-2">
<h2 id="org578b7ec"><span class="section-number-2">4.</span> Creación de entornos virtuales</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Instalar `virtualenv`:</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">sudo apt install python3-pip
sudo apt install python3-virtualenv
</pre>
</div>
<ul class="org-ul">
<li>Crear un nuevo entorno virtual</li>
</ul>
<p>
Ve al directorio en el que deseas crear el entorno virtual y ejecuta el siguiente comando para crear uno nuevo. Puedes reemplazar `mi<sub>entorno</sub>` con el nombre que prefieras para tu entorno virtual.
</p>
<div class="org-src-container">
<pre class="src src-bash">virtualenv mi_entorno
</pre>
</div>
<ul class="org-ul">
<li>Activar entorno virtual</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #e5786d;">source</span> mi_entorno/bin/activate
</pre>
</div>
<ul class="org-ul">
<li>Desactivar el entorno virtual</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">deactivate
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-03-21 vie 00:00</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
